Revit 2027 API
ParameterTypeId.StairstypeLandingType Property
 "Landing Type": Landing Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeLandingType { get; }
Public Shared ReadOnly Property StairstypeLandingType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeLandingType {
	ForgeTypeId^ get ();
}
static member StairstypeLandingType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace